[{
        "id": 1,
        "year": "73-74",
        "title": "won Pacific Division, but lost to Bucks in playoffs. Chamberlain retired after season.",
        "text": "During the 1973-74 season, the team was hampered by the loss of West, who played only 31 games before his legs gave out. Goodrich, averaging 25.3 points, helped the team to a late-season surge. Trailing the Golden State Warriors by three games with seven left to play, the Lakers rallied to finish 47-35 and win the Pacific Division. They made the playoffs but managed just one win against Milwaukee in the conference semifinals. Following the season, West retired due to contract disagreements with Cooke, and filed a suit for unpaid back wages.",
        "image": "7374.jpg",
        "imageAlt": "Kareem Abdul-jabbar with his classic 33 Lakers jersy"
    },
    {
        "id": 2,
        "year": "74-75",
        "title": "first losing season in eight years and first time missing the playoffs in 17 years.",
        "text": "After missing the playoffs in the 1974-75 season, the Lakers acquired Kareem Abdul-Jabbar, who had won three league MVP's by that time. Abdul-Jabbar wanted out of Milwaukee, demanding a trade to either New York or Los Angeles. He was traded for Elmore Smith, Brian Winters, Junior Bridgeman, and Dave Meyers. Abdul-Jabbar had his fourth MVP season in 1975-76, leading the league in rebounding, blocked shots, and minutes played. The Lakers struggled in January, going 3-10, and finished out of the playoffs at 40-42.",
        "image": "7475.jpg",
        "imageAlt": "James Worthy going for the dunk with larry bird looking at him"
    },
    {
        "id": 3,
        "year": "76-77",
        "title": "bounced back with a league-best 53 wins and 29 losses, winning the Pacific Division and earning the top seed in the Western Conference. However, were upset by the Seattle SuperSonics in the first round of the playoffs.",
        "text": "West and Cooke settled their differences-and the former Laker's lawsuit-and Cooke hired him to replace Sharman as the team's coach. West became upset, however, when Cooke refused to spend the money necessary to acquire forward Julius Erving, who the Nets were selling. Behind another MVP season from Abdul-Jabbar, Los Angeles won the Pacific Division, finishing the 1976-77 season a league-best 53-29. They defeated the Warriors in a seven-game series to open the postseason before being swept by Portland in the Western Conference Finals. During the off-season, Los Angeles picked up Jamaal Wilkes from Golden State and signed first-round draft pick Norm Nixon.",
        "image": "7677.jpg",
        "imageAlt": "James Edwards fighting on the ball with Celtics player no.40"
    },
    {
        "id": 4,
        "year": "77-78",
        "title": "had another solid season with 45 wins and 37 losses, finishing fourth in the Pacific Division and fifth in the Western Conference. faced the SuperSonics again in the first round of the playoffs, but lost in three games once more",
        "text": "In the first two minutes of the first game of the 1977-78 season, Abdul-Jabbar punched Bucks center Kent Benson for an overly aggressive elbow and broke his hand. Two months later, a healthy Abdul-Jabbar got into an altercation with Houston Rockets center Kevin Kunnert after a rebound. The team's starting power forward, Kermit Washington, who was averaging 11.5 points and 11.2 rebounds, entered the fight, and when Rudy Tomjanovich ran in from the bench to break up the action, Washington punched him in the face.Tomjanovich nearly died from the punch, suffering a fractured skull and other facial injuries, which prematurely ended his playing career. Washington, who stated that he assumed Tomjanovich was a combatant, was suspended for two months by the NBA, and released by the Lakers. The team won 45 games despite being down a starter in Washington and not having Abdul-Jabbar for nearly two months, but lost in the first round of the playoffs to Seattle. During the 1978-79 season, the team posted a 47-35 record but lost to the SuperSonics in the semifinal round of the playoffs.",
        "image": "7778.webp",
        "imageAlt": "Kareem Abdul-jabbar looking frustrated"
    },
    {
        "id": 5,
        "year": "22-23",
        "title": "fired Vogel, hired Ham, reached conference finals, lost to Nuggets. James broke scoring record.",
        "text": "The Lakers had a turbulent season, firing their coach, dealing with injuries, and barely making the playoffs as the 7th seed. They surprised everyone by reaching the Western Conference finals, but they were swept by the Nuggets. LeBron James broke the scoring record, Anthony Davis was dominant, and Russell Westbrook was traded. The Lakers also retired the jerseys of George Mikan and Pau Gasol.",
        "image": "2223.jpg",
        "imageAlt": "Lebron and Schroder stares down Timberwolves bench with 'ice in my viens' celebration after winning in the play-in game"
    }
]